app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    @items = Item.includes(:category).all

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
---
  def show
    @item = Item.find(params[:id])