app/models/user.rb

  def user_cart
    Cart.create(user_id: self.id)
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2020-03-09 16:09:02.466235"], ["updated_at", "2020-03-09 16:09:02.466235"]]